<!-- placeholder-1 -->
```fish
terraform plan -chdir=.
```
<!-- placeholder-2 -->

<details><summary>Diff of 50 changes.</summary>

```diff
+ module.iam.aws_iam_instance_profile.salt_master will be created
+ module.iam.aws_iam_instance_profile.validator will be created
+ module.iam.aws_iam_openid_connect_provider.github_actions will be created
+ module.iam.aws_iam_role.github_actions will be created
+ module.iam.aws_iam_role.salt_master will be created
+ module.iam.aws_iam_role.validator will be created
+ module.iam.aws_iam_role_policy.github_actions_test will be created
+ module.iam.aws_iam_role_policy.salt_master_ec2_policy will be created
+ module.iam.aws_iam_role_policy.validator_ec2 will be created
+ module.iam.aws_iam_role_policy.validator_route53 will be created
+ module.iam.aws_iam_role_policy.validator_s3 will be created
+ module.iam.google_iam_workload_identity_pool.github_actions will be created
+ module.iam.google_iam_workload_identity_pool_provider.github_actions will be created
+ module.iam.google_project_iam_member.github_actions_permissions will be created
+ module.iam.google_project_iam_member.validator_compute will be created
+ module.iam.google_project_iam_member.validator_network will be created
+ module.iam.google_project_iam_member.validator_storage will be created
+ module.iam.google_service_account.github_actions will be created
+ module.iam.google_service_account.validator will be created
+ module.iam.google_service_account_iam_binding.github_actions_workload_identity will be created
~ module.instances.data.aws_ami.ubuntu_arm64 will be read during apply
# (depends on a resource or a module with changes pending)
~ module.instances.data.aws_ami.ubuntu_x86_64 will be read during apply
# (depends on a resource or a module with changes pending)
~ module.instances.data.aws_region.current will be read during apply
# (depends on a resource or a module with changes pending)
~ module.instances.data.cloudinit_config.salt_master will be read during apply
# (depends on a resource or a module with changes pending)
+ module.instances.aws_instance.salt_master will be created
+ module.instances.aws_key_pair.deployer will be created
+ module.instances.aws_route53_record.salt_master will be created
+ module.instances.aws_security_group_rule.salt_master_vault_self_public will be created
+ module.networking.aws_internet_gateway.main will be created
+ module.networking.aws_route_table.main will be created
+ module.networking.aws_route_table_association.main will be created
+ module.networking.aws_security_group.salt_master will be created
+ module.networking.aws_security_group.validator will be created
+ module.networking.aws_security_group_rule.validator_admin will be created
+ module.networking.aws_security_group_rule.validator_salt will be created
+ module.networking.aws_security_group_rule.validator_ssh will be created
+ module.networking.aws_subnet.main will be created
+ module.networking.aws_vpc.main will be created
+ module.networking.google_compute_firewall.salt_minion will be created
+ module.networking.google_compute_firewall.validator will be created
+ module.networking.google_compute_firewall.validator_ssh will be created
+ module.networking.google_compute_network.main will be created
+ module.networking.google_compute_subnetwork.main will be created
+ module.storage.aws_s3_bucket.validator will be created
+ module.storage.aws_s3_bucket_lifecycle_configuration.validator will be created
+ module.storage.aws_s3_bucket_policy.validator will be created
+ module.storage.aws_s3_bucket_public_access_block.validator will be created
+ module.storage.google_storage_bucket.validator will be created
+ module.storage.google_storage_bucket_iam_binding.validator will be created
+ module.storage.random_id.bucket_suffix will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 46 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @jmiller0 at 2025-03-07T23:36:21Z [(view log)](https://github.com/jmiller0/terraform-solana/actions/runs/13731268999/job/38408636560#step:7:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam.aws_iam_instance_profile.salt_master will be created
  + resource "aws_iam_instance_profile" "salt_master" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "salt-master-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "salt-master-role"
      + tags        = {
          + "Name" = "salt-master-instance-profile"
        }
      + tags_all    = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "salt-master-instance-profile"
          + "Project"     = "Validator"
          + "Service"     = "Solana"
        }
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_instance_profile.validator will be created
  + resource "aws_iam_instance_profile" "validator" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "validator-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "validator-role"
      + tags        = {
          + "Name" = "validator-instance-profile"
        }
      + tags_all    = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "validator-instance-profile"
          + "Project"     = "Validator"
          + "Service"     = "Solana"
        }
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "github-actions-oidc-provider"
        }
      + tags_all        = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "github-actions-oidc-provider"
          + "Project"     = "Validator"
          + "Service"     = "Solana"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.iam.aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-terraform-test"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "github-actions-role"
        }
      + tags_all              = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "github-actions-role"
          + "Project"     = "Validator"
          + "Service"     = "Solana"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.salt_master will be created
  + resource "aws_iam_role" "salt_master" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "salt-master-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "salt-master-role"
        }
      + tags_all              = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "salt-master-role"
          + "Project"     = "Validator"
          + "Service"     = "Solana"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.validator will be created
  + resource "aws_iam_role" "validator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "validator-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "validator-role"
        }
      + tags_all              = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "validator-role"
          + "Project"     = "Validator"
          + "Service"     = "Solana"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy.github_actions_test will be created
  + resource "aws_iam_role_policy" "github_actions_test" {
      + id          = (known after apply)
      + name        = "github-actions-test-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:DescribeInstances",
                          + "ec2:TerminateInstances",
                          + "ec2:StartInstances",
                          + "ec2:StopInstances",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                          + "ec2:DescribeTags",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:DescribeInstanceAttribute",
                          + "ec2:RequestSpotInstances",
                          + "ec2:CancelSpotInstanceRequests",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:CreateSpotDatafeedSubscription",
                          + "ec2:DeleteSpotDatafeedSubscription",
                          + "ec2:DescribeVpcs",
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:DescribeSubnets",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:ModifySubnetAttribute",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:UpdateSecurityGroupRuleDescriptionsIngress",
                          + "ec2:AuthorizeSecurityGroupEgress",
                          + "ec2:RevokeSecurityGroupEgress",
                          + "ec2:UpdateSecurityGroupRuleDescriptionsEgress",
                          + "ec2:CreateInternetGateway",
                          + "ec2:DeleteInternetGateway",
                          + "ec2:AttachInternetGateway",
                          + "ec2:DetachInternetGateway",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:CreateRoute",
                          + "ec2:DeleteRoute",
                          + "ec2:CreateRouteTable",
                          + "ec2:DeleteRouteTable",
                          + "ec2:AssociateRouteTable",
                          + "ec2:DisassociateRouteTable",
                          + "ec2:ReplaceRouteTableAssociation",
                          + "ec2:DescribeRouteTables",
                          + "ec2:CreateVolume",
                          + "ec2:DeleteVolume",
                          + "ec2:AttachVolume",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumeStatus",
                          + "ec2:CreateKeyPair",
                          + "ec2:DeleteKeyPair",
                          + "ec2:ImportKeyPair",
                          + "ec2:DescribeKeyPairs",
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:CreateInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                          + "iam:AddRoleToInstanceProfile",
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:GetInstanceProfile",
                          + "iam:ListInstanceProfilesForRole",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:CreateBucket",
                          + "s3:DeleteBucket",
                          + "s3:PutBucketPolicy",
                          + "s3:DeleteBucketPolicy",
                          + "s3:GetBucketPolicy",
                          + "s3:PutBucketVersioning",
                          + "s3:GetBucketVersioning",
                          + "s3:PutBucketPublicAccessBlock",
                          + "s3:GetBucketPublicAccessBlock",
                          + "route53:ListHostedZones",
                          + "route53:GetHostedZone",
                          + "route53:ListResourceRecordSets",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:CreateHostedZone",
                          + "route53:DeleteHostedZone",
                          + "route53:GetChange",
                          + "kms:CreateGrant",
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                          + "kms:GenerateDataKey",
                          + "logs:CreateLogGroup",
                          + "logs:DeleteLogGroup",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:DeleteLogStream",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestedRegion" = "us-east-1"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy.salt_master_ec2_policy will be created
  + resource "aws_iam_role_policy" "salt_master_ec2_policy" {
      + id          = (known after apply)
      + name        = "salt-master-ec2-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy.validator_ec2 will be created
  + resource "aws_iam_role_policy" "validator_ec2" {
      + id          = (known after apply)
      + name        = "validator-ec2-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:GetConsoleOutput",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumeStatus",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "cloudwatch:PutMetricData",
                          + "cloudwatch:GetMetricData",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:ListMetrics",
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy.validator_route53 will be created
  + resource "aws_iam_role_policy" "validator_route53" {
      + id          = (known after apply)
      + name        = "route53-update-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z2QJWI0PQQ7XT5",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy.validator_s3 will be created
  + resource "aws_iam_role_policy" "validator_s3" {
      + id          = (known after apply)
      + name        = "validator-s3-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketVersioning",
                          + "s3:PutObjectTagging",
                          + "s3:GetObjectTagging",
                          + "s3:GetBucketTagging",
                          + "s3:HeadBucket",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketAcl",
                          + "s3:GetObjectAcl",
                          + "s3:PutObjectAcl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::*",
                          + "arn:aws:s3:::aws-sol-val",
                          + "arn:aws:s3:::aws-sol-val/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.google_iam_workload_identity_pool.github_actions will be created
  + resource "google_iam_workload_identity_pool" "github_actions" {
      + description               = "Identity pool for GitHub Actions"
      + display_name              = "GitHub Actions Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "solval1"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-actions-pool"
    }

  # module.iam.google_iam_workload_identity_pool_provider.github_actions will be created
  + resource "google_iam_workload_identity_pool_provider" "github_actions" {
      + attribute_condition                = "assertion.repository == \"jmiller0/terraform-solana\""
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "OIDC identity pool provider for GitHub Actions"
      + display_name                       = "GitHub Actions Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "solval1"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-actions-pool"
      + workload_identity_pool_provider_id = "github-actions-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.iam.google_project_iam_member.github_actions_permissions will be created
  + resource "google_project_iam_member" "github_actions_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "solval1"
      + role    = "roles/editor"
    }

  # module.iam.google_project_iam_member.validator_compute will be created
  + resource "google_project_iam_member" "validator_compute" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "solval1"
      + role    = "roles/compute.instanceAdmin.v1"
    }

  # module.iam.google_project_iam_member.validator_network will be created
  + resource "google_project_iam_member" "validator_network" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "solval1"
      + role    = "roles/compute.networkAdmin"
    }

  # module.iam.google_project_iam_member.validator_storage will be created
  + resource "google_project_iam_member" "validator_storage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "solval1"
      + role    = "roles/storage.objectViewer"
    }

  # module.iam.google_service_account.github_actions will be created
  + resource "google_service_account" "github_actions" {
      + account_id   = "github-actions-terraform"
      + disabled     = false
      + display_name = "GitHub Actions Terraform"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "solval1"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account.validator will be created
  + resource "google_service_account" "validator" {
      + account_id   = "validator-sa"
      + disabled     = false
      + display_name = "Validator Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "solval1"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account_iam_binding.github_actions_workload_identity will be created
  + resource "google_service_account_iam_binding" "github_actions_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.instances.data.aws_ami.ubuntu_arm64 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu_arm64" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "099720109477",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "architecture"
          + values = [
              + "arm64",
            ]
        }
      + filter {
          + name   = "name"
          + values = [
              + "ubuntu/images/hvm-ssd/ubuntu-jammy-22.04-arm64-server-*",
            ]
        }
      + filter {
          + name   = "root-device-type"
          + values = [
              + "ebs",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.instances.data.aws_ami.ubuntu_x86_64 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu_x86_64" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "099720109477",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "architecture"
          + values = [
              + "x86_64",
            ]
        }
      + filter {
          + name   = "name"
          + values = [
              + "ubuntu/images/hvm-ssd/ubuntu-jammy-22.04-amd64-server-*",
            ]
        }
      + filter {
          + name   = "root-device-type"
          + values = [
              + "ebs",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.instances.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.instances.data.cloudinit_config.salt_master will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "salt_master" {
      + base64_encode = false
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #!/bin/bash
                
                # Log all output
                exec 1> >(logger -s -t $(basename $0)) 2>&1
                
                # Exit on error
                set -e
                
                # Set hostname
                hostnamectl set-hostname salt-master
                echo "salt-master" > /etc/hostname
                echo "127.0.1.1 salt-master" >> /etc/hosts
                
                # Install Salt master
                mkdir -p /etc/apt/keyrings
                curl -fsSL https://packages.broadcom.com/artifactory/api/security/keypair/SaltProjectKey/public | tee /etc/apt/keyrings/salt-archive-keyring.pgp
                curl -fsSL https://github.com/saltstack/salt-install-guide/releases/latest/download/salt.sources | tee /etc/apt/sources.list.d/salt.sources
                
                # Install required packages
                apt-get update
                apt-get install -y salt-master salt-minion python3-pip python3-gnupg awscli jq unzip software-properties-common openssl
                
                # Install Vault
                curl -fsSL https://apt.releases.hashicorp.com/gpg | apt-key add -
                ARCH=$(dpkg --print-architecture)
                apt-add-repository "deb [arch=$ARCH] https://apt.releases.hashicorp.com $(lsb_release -cs) main"
                apt-get update
                apt-get install -y vault
                
                # Create required directories
                mkdir -p /etc/salt/master.d
                mkdir -p /etc/salt/gpgkeys
                mkdir -p /opt/vault/data
                mkdir -p /opt/vault/tls
                
                # Set proper permissions (fix ownership)
                chown -R root:root /etc/salt
                chown -R root:salt /etc/salt/gpgkeys
                chmod 700 /etc/salt/gpgkeys
                chown -R vault:vault /opt/vault
                
                # Configure GPG for Salt master
                cat > /etc/salt/master.d/gpg.conf << EOF
                # GPG configuration for Salt master
                gpg_keydir: /etc/salt/gpgkeys
                EOF
                
                # Set aws_root_zone as a grain
                cat > /etc/salt/grains << EOF
                aws_root_zone: aws.miller.center
                EOF
                
                # Configure GPG renderer for pillar decryption
                cat > /etc/salt/master.d/gpg_renderer.conf << EOF
                # Enable GPG renderer for pillar decryption
                decrypt_pillar_default: gpg
                decrypt_pillar_renderers:
                  - gpg
                EOF
                
                # Generate GPG key for Salt master
                cat > /tmp/gpg_batch << EOF
                %echo Generating GPG key for Salt Master
                Key-Type: RSA
                Key-Length: 2048
                Name-Real: Salt Master
                Name-Email: salt@localhost
                Expire-Date: 0
                %no-protection
                %commit
                %echo Done
                EOF
                
                # Generate GPG key with proper ownership
                gpg --batch --gen-key --homedir /etc/salt/gpgkeys /tmp/gpg_batch
                rm /tmp/gpg_batch
                
                # Fix GPG directory permissions after key generation
                chown -R root:salt /etc/salt/gpgkeys
                chmod -R 700 /etc/salt/gpgkeys
                
                # Generate self-signed TLS cert for Vault
                openssl req -x509 -nodes -days 365 -newkey rsa:2048 \
                  -keyout /opt/vault/tls/tls.key \
                  -out /opt/vault/tls/tls.crt \
                  -subj "/CN=salt-master.aws.miller.center/O=Salt Master/C=US" \
                  -addext "subjectAltName = DNS:salt-master.aws.miller.center,DNS:salt-master,DNS:localhost,IP:127.0.0.1"
                
                chown vault:vault /opt/vault/tls/tls.*
                chmod 600 /opt/vault/tls/tls.key
                chmod 644 /opt/vault/tls/tls.crt
                
                # Basic Salt master configuration
                cat > /etc/salt/master << EOF
                interface: 0.0.0.0
                auto_accept: True
                file_roots:
                  base:
                    - /srv/salt
                pillar_roots:
                  base:
                    - /srv/salt/pillar
                log_level: info
                log_level_logfile: info
                hash_type: sha256
                worker_threads: 5
                timeout: 60
                job_cache: True
                keep_jobs: 24
                EOF
                
                # Install Vault extension
                /opt/saltstack/salt/bin/pip3 install saltext-vault
                
                # Vault configuration with TLS
                cat > /etc/vault.d/vault.hcl << EOF
                storage "file" {
                  path = "/opt/vault/data"
                }
                
                listener "tcp" {
                  address     = "0.0.0.0:8200"
                  tls_cert_file = "/opt/vault/tls/tls.crt"
                  tls_key_file  = "/opt/vault/tls/tls.key"
                }
                
                disable_mlock = true
                ui = true
                api_addr = "https://0.0.0.0:8200"
                EOF
                
                # Configure Salt master to use Vault
                cat > /etc/salt/master.d/vault.conf << EOF
                vault:
                  auth:
                    method: token
                    token_file: /etc/salt/vault_token
                    token_backend: session
                  server:
                    url: https://127.0.0.1:8200
                    verify: /opt/vault/tls/tls.crt
                EOF
                
                #Write minion vault.conf
                cat > /etc/salt/minion.d/vault.conf << EOF
                vault:
                  config_location: master
                  verify: /opt/vault/tls/tls.crt
                EOF
                
                # Write Salt minion configuration
                cat > /etc/salt/minion << EOF
                master: 127.0.0.1
                id: salt-master
                random_id: false
                hash_type: sha256
                EOF
                
                # Write minion_id file explicitly
                echo "salt-master" > /etc/salt/minion_id
                
                # Start services
                systemctl restart salt-master
                systemctl enable salt-master
                systemctl restart vault
                systemctl enable vault
                
                # Initialize Vault
                sleep 5  # Wait for Vault to start
                
                # POC configuration: Using single key for simplicity
                # Production should use multiple keys (e.g., -key-shares=3 -key-threshold=2)
                VAULT_ADDR='https://127.0.0.1:8200' VAULT_SKIP_VERIFY=true vault operator init -key-shares=1 -key-threshold=1 > /root/vault-init.txt
                
                # Store initialization output securely
                chmod 600 /root/vault-init.txt
                
                # Extract root token and save it for Salt
                grep 'Initial Root Token:' /root/vault-init.txt | awk '{print $NF}' > /etc/salt/vault_token
                chmod 600 /etc/salt/vault_token
                chown root:salt /etc/salt/vault_token
                
                # Unseal Vault using the single key (POC only)
                UNSEAL_KEY1=$(grep 'Unseal Key 1:' /root/vault-init.txt | awk '{print $NF}')
                export VAULT_SKIP_VERIFY=true
                VAULT_ADDR='https://127.0.0.1:8200' vault operator unseal $UNSEAL_KEY1
                
                export VAULT_TOKEN=$(cat /etc/salt/vault_token)
                export VAULT_ADDR='https://127.0.0.1:8200'
                
                # Enable AppRole auth method
                vault auth enable approle
                
                # Create AppRole for validators
                vault write auth/approle/role/validator \
                  secret_id_ttl=0 \
                  token_ttl=1h \
                  token_max_ttl=4h \
                  policies=validator-policy,salt_minion_base
                
                # Create AppRole for test minions
                vault write auth/approle/role/gcp-test-minion \
                  secret_id_ttl=0 \
                  token_ttl=24h \
                  token_max_ttl=48h \
                  policies=test-minion-policy,salt_minion_base
                
                # Generate AppRole credentials
                vault read -field=role_id auth/approle/role/validator/role-id > /tmp/role_id.txt
                vault write -f -field=secret_id auth/approle/role/validator/secret-id > /tmp/secret_id.txt
                
                # Encrypt AppRole credentials with GPG
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/role_id.gpg /tmp/role_id.txt
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/secret_id.gpg /tmp/secret_id.txt
                
                # Update approle.sls with encrypted credentials
                cat > /srv/salt/pillar/approle.sls << EOF
                #!yaml|gpg
                
                vault:
                  approle:
                    role_id: |
                $(cat /tmp/role_id.gpg | sed 's/^/      /')
                    secret_id: |
                $(cat /tmp/secret_id.gpg | sed 's/^/      /')
                EOF
                
                # Set proper permissions on pillar files
                chmod 640 /srv/salt/pillar/approle.sls
                chown root:salt /srv/salt/pillar/approle.sls
                
                # Add Vault environment variables to /etc/environment for persistence
                cat >> /etc/environment << EOF
                VAULT_ADDR="https://127.0.0.1:8200"
                VAULT_SKIP_VERIFY=true
                EOF
                
                # Enable KV secrets engine
                vault secrets enable -version=2 kv
                vault secrets enable -path=secret kv
                
                # Create pillar directory with proper permissions
                mkdir -p /srv/salt/pillar/vault
                chown root:salt /srv/salt/pillar/vault
                chmod 750 /srv/salt/pillar/vault
                
                # Now encrypt the certificates and token
                CERT=$(cat /opt/vault/tls/tls.crt)
                KEY=$(cat /opt/vault/tls/tls.key)
                TOKEN=$(cat /etc/salt/vault_token)
                
                # Create temporary files with proper permissions
                install -m 600 /dev/null /tmp/cert.txt
                install -m 600 /dev/null /tmp/key.txt
                install -m 600 /dev/null /tmp/token.txt
                
                echo "$CERT" > /tmp/cert.txt
                echo "$KEY" > /tmp/key.txt
                echo "$TOKEN" > /tmp/token.txt
                
                # Encrypt files with GPG
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/cert.gpg /tmp/cert.txt
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/key.gpg /tmp/key.txt
                gpg --homedir /etc/salt/gpgkeys --trust-model always --armor --batch --yes --encrypt --recipient "Salt Master" --output /tmp/token.gpg /tmp/token.txt
                
                # Create pillar file with encrypted values
                cat > /srv/salt/pillar/vault/certs.sls << EOF
                #!yaml|gpg
                
                vault:
                  tls:
                    cert: |
                $(cat /tmp/cert.gpg | sed 's/^/      /')
                    key: |
                $(cat /tmp/key.gpg | sed 's/^/      /')
                EOF
                
                # Clean up temporary files securely
                shred -u /tmp/cert.txt /tmp/key.txt /tmp/token.txt /tmp/cert.gpg /tmp/key.gpg /tmp/token.gpg /tmp/role_id.txt /tmp/secret_id.txt /tmp/role_id.gpg /tmp/secret_id.gpg
                
                # Final validation
                if ! gpg --list-keys --homedir /etc/salt/gpgkeys | grep -q "Salt Master"; then
                    echo "ERROR: GPG key setup failed"
                    exit 1
                fi
                
                if ! VAULT_SKIP_VERIFY=true vault status | grep -q "Sealed.*false"; then
                    echo "ERROR: Vault is not properly unsealed"
                    exit 1
                fi
                
                if ! systemctl is-active --quiet salt-master; then
                    echo "ERROR: Salt master is not running"
                    exit 1
                fi
                
                systemctl restart salt-master
                systemctl restart salt-minion
                sleep 30
                salt-call state.apply
                
                echo "Salt master and Vault initialization complete. IMPORTANT: Save /root/vault-init.txt securely!"
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "salt-master-init.tpl"
        }
      + part {
          + content      = <<-EOT
                #!/bin/bash
                export VAULT_SKIP_VERIFY=true
                export VAULT_ADDR="https://127.0.0.1:8200"
                export VAULT_TOKEN=$(cat /etc/salt/vault_token)
                      
                # Only process keypairs that exist
                 
…
```
</details>
<!-- placeholder-5 -->
<!-- terraform-9-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->